<template>
  <v-container>
  <v-row justify="center">
    <v-expansion-panels popout>
      <v-expansion-panel
        v-for="(expansion, index) in expansions"
        :key="index"
      >
        <v-expansion-panel-header>
          <h3>
          {{ expansion.title }}
          </h3>
          <template v-slot:actions>
            <v-img :src="expansion.icon"></v-img>
          </template>
        </v-expansion-panel-header>
        <v-expansion-panel-content>
          <v-row>
          <v-col :cols="4">
            <v-img
              max-height="250"
              max-width="400"
              :src="expansion.imageSrc"
            ></v-img>
          </v-col>
          <v-col :cols="8">{{ expansion.description }}</v-col>
          </v-row>
        </v-expansion-panel-content>
      </v-expansion-panel>
    </v-expansion-panels>
  </v-row>
  </v-container>
</template>

<script lang="ts">
import

{ Vue, Component } from 'vue-property-decorator';

@Component
export default class Expansion extends Vue {
  private expansions = [
    {
      title: 'Бижутерия "Jenavi"',
      icon: 'http://shop.nbacademy.ru/img/logo-jenavi.jpg',
      description: 'Jenavi – самая крупная и успешная компания в России, производящая ювелирную '
        + 'бижутерию с 1991 года. Ювелирная бижутерия изготавливается на собственном производстве '
        + 'полного цикла в Санкт-Петербурге. Украшения Jenavi — органичное сочетание актуальных мировых '
        + 'трендов и лучших традиций столицы ювелирного искусства Санкт-Петербурга.'
        + ' Все модные тенденции присутствуют в коллекциях Jenavi, которые создаются собственным дизайнерским бюро.'
        + 'Jenavi – бриллиантовый партнер всемирно известного австрийского бренда Swarovski,'
        + 'кристаллы которого украшают изделия.'
        + 'Также используются натуральные и поделочные камни, гипоаллергенное гальваническое покрытие'
        + 'золотом, серебром, родием высочайших проб.'
        + 'Jenavi активно сотрудничает с ведущими дизайнерами Санкт-Петербурга, России и мира,'
        + 'создает эксклюзивные изделия для известных модельеров и стилистов, звезд шоу-бизнеса,'
        + 'масштабных конкурсов красоты, а также крупнейших fashion компаний.',
      imageSrc: 'http://shop.nbacademy.ru/img/Logo78787.png',
    },
    {
      title: 'Аксессуары для волос',
      icon: 'http://shop.nbacademy.ru/img/bow.jpg',
      description: 'Аксессуары для волос - это необходимый атрибут любой девушки, который дополняет'
        + 'образ и подчёркивает вашу уникальную красоту.'
        + 'В нашем магазине вы найдёте большое количество украшений и аксессуаров для волос на любой вкус.'
        + 'Мы постоянно обновляем имеющийся у нас ассортимент, поэтому каждый раз, заходя в наш магазин,'
        + 'вы можете увидеть какие-то новые украшения и аксессуары.',
      imageSrc: 'http://shop.nbacademy.ru/img/bow1.jpg',
    },
    {
      title: 'Солнцезащитные очки',
      icon: 'http://shop.nbacademy.ru/img/bigGlass.jpg',
      description: 'Солнцезащитные очки являются любимым модным аксессуаром, как для женщины,'
        + 'так и для мужчины. Мы носим их в повседневной жизни, на работу, мы в них, когда находимся'
        + 'в горах или на море. В последнее время, в связи с истощением озонового слоя в атмосфере и'
        + 'увеличением интенсивности ультрафиолетовых лучей (UVA, UVB, UVC), солнцезащитные очки являются'
        + 'необходимостью для каждого человека, чтобы сохранить свое здоровье.'
        + 'Солнцезащитные очки являются основным средством для защиты глаз и чувствительной'
        + 'области кожи вокруг глаз от видимых и невидимых вредных олнечных лучей. Неправильным'
        + 'является убеждение, что в летнее время УФ-лучи сильнее. В любое время года, они имеют'
        + ' сильное воздействие на человека, поэтому солнцезащитные очки не только летний аксессуар,'
        + 'в них можно ходить круглый год.',
      imageSrc: 'http://shop.nbacademy.ru/img/glass1.jpg',
    },
    {
      title: 'Бижутерия',
      icon: 'http://shop.nbacademy.ru/img/jevely-small.jpg',
      description: 'Несомненно, бижутерия — это модно. Это не пустые слова.'
        + 'Ведь тон моде задают отнюдь не дорогостоящие ювелирные изделия, они лишь следуют'
        + 'тем тенденциям, которые сложились до них, благодаря бижутерным украшениям.'
        + 'Все это возможно потому, что с бижутерией можно экспериментировать, причем очень быстро'
        + 'и это не так затратно, как с ювелирными украшениями. Вы можете покупать новые изделия,'
        + 'менять наряды, дополнять свои коллекции новыми украшениями, подбирать всевозможные комбинации'
        + 'из своих коллекций. Все это можно делать за короткие промежутки времени. Мода любит перемены,'
        + 'причем очень стремительные и неожиданные. Эти перемены гарантируют успех, всеобщее признание'
        + 'и уважение. Всего этого вы можете достичь с помощью бижутерии. Вас ничего не ограничивает,'
        + 'только ваша фантазия, творите и спешите совершенствоваться. А тенденции моды, которые очень'
        + 'ярко проявляются в бижутерных украшениях, только помогут вам и окажут незаменимую услугу.',
      imageSrc: 'http://shop.nbacademy.ru/img/china.jpg',
    },
    {
      title: 'Зонты',
      icon: '',
      description: 'Как купить надежную модель зонтика? Для начала несколько раз откройте и закройте зонт.'
        + 'Убедитесь, что механизм не заедает. Обратите внимание на натяжение ткани. У зонта-трости'
        + 'материал натянут плотно, у складных моделей - слабее. Но не слишком сабо, иначе от дождя'
        + 'она и вовсе провиснет. Покачайте зонт. Если стержень жестко закреплен, спицы не будут'
        + 'болтаться из стороны в сторону. Проверьте места крепления ткани к спицам.'
        + 'Лучше, если материал не просто пришит нитками, а еще и закреплен специальными колпачками.'
        + 'Выбирая зонт для ребенка, проверьте его безопасность. Концы спиц должны быть закрыты'
        + 'пластмассовыми шариками. Никакой остроконечной верхушки! А фиксатор на стержне зонтика'
        + '- тоже пластмассовый, тогда он не прищемит ребенку пальчики.',
      imageSrc: '',
    },
    {
      title: 'Мягкие игрушки',
      icon: 'http://shop.nbacademy.ru/img/toys-small.jpg',
      description: 'У многих детей есть не просто любимые игрушки, а самые-самые прелюбимые.'
        + 'Те, которых можно сажать с собой за стол и угощать своими любимыми лакомствами.'
        + 'Те, без которых трудно уснуть, кому можно уткнуться в теплый бочок и поплакать,'
        + 'если тебя несправедливо обидели. Они даже могут помочь в трудной ситуации – например,'
        + 'когда малыш только-только привыкает к детскому саду, где нет мамы, бегают какие-то'
        + 'непонятные дети, и у всех теть чужие голоса. Но если взял с собой из дома своего'
        + 'игрушечного друга, все не так плохо: он и утешит, и выслушает, и поддержит.'
        + 'Так вот, крайне редко такими друзьями становятся куклы, солдатики и уж тем более'
        + 'машинки или самолетики. В основном это они – пушистые и симпатичные мягкие игрушки.'
        + 'Почему-то именно зверят, меховых и плюшевых, дети с легкостью «одушевляют», наделяют'
        + 'характерами, говорят за них измененными голосами. Правда, не всех. Бывают мягкие игрушки,'
        + 'с которыми дружить не хочется.',
      imageSrc: 'http://shop.nbacademy.ru/img/toys1.jpg',
    },
    {
      title: 'Наручные часы',
      icon: 'http://shop.nbacademy.ru/img/clock.jpg',
      description: 'Наручные часы уже давно превратились в стильный и модный аксессуар,'
        + 'способный подчеркнуть ваш образ. Как выбрать те, которые помогут оставаться модной и,'
        + 'при этом, будут удобны и функциональны? Ушли в прошлое те года, когда часы были нужны'
        + 'нам исключительно для того, чтобы следить за временем. Сегодня производители ориентируются'
        + 'не только на функциональность, но и на внешний вид и стиль наручных часов. Они могут стать'
        + 'прекрасным дополнением и вечернего наряда, и делового образа, создать романтическое'
        + 'настроение или подчеркнуть женственность их обладательницы. Хотите быть в тренде?'
        + 'Тогда выбирайте часы, учитывая модные тенденции!',
      imageSrc: 'http://shop.nbacademy.ru/img/clocks2.jpg',
    },
    {
      title: 'Перчатки и варешки',
      icon: 'http://shop.nbacademy.ru/img/gloves-small.jpg',
      description: 'С наступлением холодов без перчаток не обойтись. Что еще так согреет руки,'
        + 'да и оригинально завершит образ. Этой осенью модные бренды предоставили огромный выбор'
        + 'перчаток на любой вкус и стиль. Такого разнообразия перчаток на подиуме мы давно не видели.'
        + 'Дизайнеры не стеснялись экспериментировать. В результате какую бы длину и форму перчаток'
        + 'вы не выбрали, вы точно попадете в цель. Абсолютный хит сезона – перчатки длинные,'
        + 'от локтя и выше. Носить их можно с пальто и жакетами с короткими рукавами, а также с жилетами.'
        + 'Ну и, конечно же, такие перчатки – из более тонких материалов – прекрасно подойдут к вечернему наряду.'
        + 'Короткие перчатки, естественно, более практичные. В этом сезоне стоит обратить внимание'
        + 'на модели, похожие на байкерские, на стеганую кожу, а также – замшу. В коротких перчатках'
        + 'материал и текстура важнее всего. Ну а для выходных прогулок на свежем воздухе'
        + 'приобретите модные и уютные митенки – перчатки без пальцев.',
      imageSrc: 'http://shop.nbacademy.ru/img/gloves1.jpg',
    },
  ]
}

</script>
